logs/Google_cloud/oltp_write_only.log
sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           22278
        other:                           18861
        total:                           41139
    transactions:                        6854   (684.50 per sec.)
    queries:                             41139  (4108.49 per sec.)
    ignored errors:                      6      (0.60 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0112s
    total number of events:              6854

Latency (ms):
         min:                                  6.58
         avg:                                 11.68
         max:                                173.58
         95th percentile:                     16.12
         sum:                              80038.51

Threads fairness:
    events (avg/stddev):           856.7500/28.93
    execution time (avg/stddev):   10.0048/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           35415
        other:                           28968
        total:                           64383
    transactions:                        10717  (1070.15 per sec.)
    queries:                             64383  (6428.99 per sec.)
    ignored errors:                      42     (4.19 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0126s
    total number of events:              10717

Latency (ms):
         min:                                  6.82
         avg:                                 14.93
         max:                                 74.01
         95th percentile:                     21.89
         sum:                             160039.19

Threads fairness:
    events (avg/stddev):           669.8125/8.85
    execution time (avg/stddev):   10.0024/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           47876
        other:                           38898
        total:                           86774
    transactions:                        14405  (1436.19 per sec.)
    queries:                             86774  (8651.43 per sec.)
    ignored errors:                      165    (16.45 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0279s
    total number of events:              14405

Latency (ms):
         min:                                  6.94
         avg:                                 22.24
         max:                                185.46
         95th percentile:                     34.33
         sum:                             320321.42

Threads fairness:
    events (avg/stddev):           450.1562/9.85
    execution time (avg/stddev):   10.0100/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           41001
        other:                           33784
        total:                           74785
    transactions:                        12356  (1228.78 per sec.)
    queries:                             74785  (7437.20 per sec.)
    ignored errors:                      301    (29.93 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0533s
    total number of events:              12356

Latency (ms):
         min:                                  8.12
         avg:                                 51.89
         max:                                210.99
         95th percentile:                     92.42
         sum:                             641130.32

Threads fairness:
    events (avg/stddev):           193.0625/4.82
    execution time (avg/stddev):   10.0177/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           43772
        other:                           38426
        total:                           82198
    transactions:                        13375  (1329.01 per sec.)
    queries:                             82198  (8167.65 per sec.)
    ignored errors:                      696    (69.16 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0616s
    total number of events:              13375

Latency (ms):
         min:                                  6.90
         avg:                                 95.89
         max:                               1295.29
         95th percentile:                    235.74
         sum:                            1282530.49

Threads fairness:
    events (avg/stddev):           104.4922/6.69
    execution time (avg/stddev):   10.0198/0.02

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           33001
        other:                           33496
        total:                           66497
    transactions:                        10169  (996.91 per sec.)
    queries:                             66497  (6518.96 per sec.)
    ignored errors:                      1982   (194.30 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.1982s
    total number of events:              10169

Latency (ms):
         min:                                  7.71
         avg:                                253.81
         max:                               5717.96
         95th percentile:                    831.46
         sum:                            2581040.71

Threads fairness:
    events (avg/stddev):           39.7227/7.80
    execution time (avg/stddev):   10.0822/0.05

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           7824
        other:                           26181
        total:                           34005
    transactions:                        3101   (283.52 per sec.)
    queries:                             34005  (3109.03 per sec.)
    ignored errors:                      4270   (390.40 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.9352s
    total number of events:              3101

Latency (ms):
         min:                                  8.99
         avg:                               1724.57
         max:                              10872.50
         95th percentile:                   5813.24
         sum:                            5347894.85

Threads fairness:
    events (avg/stddev):           6.0566/2.88
    execution time (avg/stddev):   10.4451/0.27